Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments
Stores the Current Comments information contained in a Document.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.Changed
Occurs when the Value of this object has changed.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.ChangeSource(System.String,Autodesk.Navisworks.Api.CommentCollection)
Changes the Current Comments.
Typically called when the focus changes from one Comment Source to an other.
sourceOwner: Internal string representing the owner of the comments.
sourceComments: The Comments.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.ChangeSource(System.String,Autodesk.Navisworks.Api.CommentCollection,System.Int32)
Changes the Current Comments.
Typically called when the focus changes from one Comment Source to an other.
sourceOwner: Internal string representing the owner of the comments.
sourceComments: The Comments.
activeCommentIndex: The Comment to select.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.Changing
Occurs when when the Value of this object is about to change.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.ClearSource
Sets situation that there is no owner, comments are cleared and editing prevented.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.CopyFrom(Autodesk.Navisworks.Api.CommentCollection)
Copies the CommentCollection from comments.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.CreateCopy
Creates a copy of the CommentCollection associated with this object.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.op_Implicit(Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments)~Autodesk.Navisworks.Api.CommentCollection
Conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.Value.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.Owner
Internal string representing the owner of the comments.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.ToCommentCollection
Explicit form of conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.Value.

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentComments.Value
The value of the current CommentsCollection within the Document.